; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v4)
		(pred_1 ?v7)
		(pred_2 ?v8)
		(pred_5 ?v8)
		(pred_3 ?v7 ?v8)
		(pred_6)
		(pred_4 ?v7))

   (:action op_1
       :parameters  (?v5 ?v2)
       :precondition (and (not-eq ?v5 ?v2) 
                          (pred_2 ?v5) (pred_2 ?v2) (pred_5 ?v5))
       :effect (and  (pred_5 ?v2)
		     (not (pred_5 ?v5))))


   (:action op_2
       :parameters (?v1 ?v6)
       :precondition  (and  (pred_1 ?v1) (pred_2 ?v6)
			    (pred_3 ?v1 ?v6) (pred_5 ?v6) (pred_6))
       :effect (and (pred_4 ?v1)
		    (not (pred_3 ?v1 ?v6)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v1  ?v6)
       :precondition  (and  (pred_1 ?v1) (pred_2 ?v6)
			    (pred_4 ?v1) (pred_5 ?v6))
       :effect (and (pred_3 ?v1 ?v6)
		    (pred_6)
		    (not (pred_4 ?v1)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_02 obj_01 obj_05 
          obj_03 obj_04 
)
(:init
(pred_2 obj_02)
(pred_2 obj_01)
(pred_2 obj_05)
(pred_1 obj_03)
(pred_1 obj_04)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_6)
(pred_3 obj_03 obj_02)
(pred_3 obj_04 obj_05)
(pred_5 obj_05)
)
(:goal
(and
(pred_3 obj_03 obj_01)
(pred_3 obj_04 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_03 obj_01) (pred_5 obj_05))
    (sometime-before  (pred_3 obj_04 obj_02) (pred_5 obj_01))
  )
)
)

; plan
1. (op_1 obj_05 obj_02)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_02)
   goals met: 0 of 2
2. (op_2 obj_03 obj_02)
   deleted: (pred_3 obj_03 obj_02) (pred_6)
   added: (pred_4 obj_03)
   goals met: 0 of 2
3. (op_1 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_01)
   goals met: 0 of 2
4. (op_3 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_3 obj_03 obj_01) (pred_6)
   goals met: 1 of 2
5. (op_1 obj_01 obj_05)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_05)
   goals met: 1 of 2
6. (op_2 obj_04 obj_05)
   deleted: (pred_3 obj_04 obj_05) (pred_6)
   added: (pred_4 obj_04)
   goals met: 1 of 2
7. (op_1 obj_05 obj_02)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_02)
   goals met: 1 of 2
8. (op_3 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_3 obj_04 obj_02) (pred_6)
   goals met: 2 of 2
